# ToString Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshFacet..::..ToString Method
PolymeshFacet Class See Also
---
Returns formatted string showing (V1, V2, V3) with values formatted as regular integers
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override string ToString()
```

Visual Basic
---
```text
Public Overrides Function ToString As String
```

Visual C++
---
```text
public:
virtual String^ ToString() override
```

# See Also
PolymeshFacet Class
Autodesk.Revit.DB Namespace